---
kind: other
id: Methods.T:Autodesk.Revit.DB.DetailLine
source: html/082d6c1c-71be-68f2-42ed-9c8f694084c7.htm
---
# DetailLine Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.